In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
# Making a DataFrame
dframe= DataFrame(np.arange(12).reshape((3, 4)),
                 index=['NY', 'LA', 'SF'],
                 columns=['A', 'B', 'C', 'D'])

In [3]:
dframe

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [4]:
# Just like a Series, axis indexes can also use map

#Let's use map: map lowercase the city initials (city is row index) to the original Uppercase City (index of dframe)

#call .map() method on index
dframe.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [5]:
# If you want to assign this to the actual index (index of original dframe), you can use index

dframe.index = dframe.index.map(str.lower)

In [6]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [7]:
# We can also use rename to insert dictionaries providing new values for indexes or columns!
#method: .rename()
#arguments: index, columns
dframe.rename(index = {'ny': 'New York'},
              columns = {'A': 'Alpha'})
#these effects are not permanent

          Alpha  B   C   D
New York      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

In [8]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [9]:
# If you would like to actually edit the data set "in place", set inplace=True
dframe.rename(index = {'ny': 'New York'},inplace=True)

In [10]:
dframe

          A  B   C   D
New York  0  1   2   3
la        4  5   6   7
sf        8  9  10  11